config/cf/InformationRegisters/СтатусыКарточекНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКарточекНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКарточекНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КарточкаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/СтатусыКарточекНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФормаТолькоПросмотр") Тогда
		ЭтаФорма.ТолькоПросмотр 				     = Истина;
		ЗаполнитьЗначенияСвойств(Запись, Параметры.СтруктураЗаписи);		
	ИначеЕсли Параметры.Свойство("КарточкаНоменклатуры") Тогда
		Запись.КарточкаНоменклатуры 			     = Параметры.КарточкаНоменклатуры;
		Элементы.КарточкаНоменклатуры.ТолькоПросмотр = Истина;
		Элементы.Пользователь.Видимость 			 = Ложь;
		Элементы.Период.Видимость					 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.Пользователь = ПользователиКлиент.ТекущийПользователь();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.Статус) Тогда		
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Статус");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Запись.Статус", , Отказ);		
		Возврат;
	КонецЕсли;	
	
	Запись.Период = ТекущаяДатаНаСервере();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.КарточкаНоменклатуры) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.СтатусыКарточекНоменклатуры.ФормаВыбора", Новый Структура("КарточкаНоменклатуры", Запись.КарточкаНоменклатуры), ЭтотОбъект, , , ,
			Новый ОписаниеОповещения("ПослеВыбораСтатуса", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Запись.Статус = Результат;
	
КонецПроцедуры	

&НаСервере
Функция ТекущаяДатаНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции	

#КонецОбласти
